{
    "data": [
        {
            "abilityName": "Configurability",
            "abilityDescription": "The ability of the system to be configured to perform a task or reconfigured to perform different tasks. This may range from the ability to re-program the system to be able to alter the physical structure of the system (e.g. by changing a tool).",
            "hasSubAbilities": false,
            "abilityLevels": [
                {
                    "level": 0,
                    "levelName": "User run-time configuration",
                    "levelDescription": "The configuration can be altered by a human or artificial agent during the system use."
                },
                {
                    "level": 1,
                    "levelName": "Run-time self configuration",
                    "levelDescription": "The system can alter its own configuration within a pre-determined set of alternative configurations designed into the system."
                },
                {
                    "level": 2,
                    "levelName": "Autonomous configuration",
                    "levelDescription": "The system can alter its own configuration in response to external factors, for example altering its morphology in response to the failure of a sensor or actuator. Note that altering configuration must be carefully distinguished from actions taken as a part of the normal autonomous operation of the system."
                }
            ]
        },
        {
            "abilityName": "Dependability",
            "abilityDescription": "The ability of the system to perform its given task(s) without systematic errors. Dependability specifies the level of trust that can be placed on the system to perform.",
            "hasSubAbilities": false,
            "abilityLevels": [
                {
                    "level": 0,
                    "levelName": "Task dependability",
                    "levelDescription": "The system is able to recognize the impact of a failure on the overall task it is undertaking and it is able to replan activities in order to minimize the impact of the failure on the task. This may also include self-repair as an alternative task."
                },
                {
                    "level": 1,
                    "levelName": "Mission dependability",
                    "levelDescription": "The system is able to recognize the impact of a failure on the overall objectives of a mission and communicate the nature of the failure to other systems to minimize the impact on the mission objectives. In turn, the system is able to receive and interpret mission failures from other systems and re-task its actions to compensate."
                },
                {
                    "level": 2,
                    "levelName": "Predictive dependability",
                    "levelDescription": "The system is able to predict that a planned future action may result in a loss of dependability, or that the effect of the partial failure of a component can be mitigated by altering future actions. Thus, the system is able to extend its dependability by exploiting predictive mechanisms that permit taking an actions before a failure is observed."
                },
				{
                    "level": 3,
                    "levelName": "Prescriptive dependability",
                    "levelDescription": "The system is able to make a more advanced use of predictive analysis that forecasts system dependability in the future. Prescriptive dependability analysis goes beyond simply predicting options in the predictive model. It actually evaluates a range of prescribed actions and the potential outcomes of each action, and it is able to choose the best actions that guarantee the highest dependability and mitigate future risks and take into account the potential outcomes of each decision option."
                }
            ]
        },
        {
            "abilityName": "Autonomy",
            "abilityDescription": "The ability of the system to act autonomously. Nearly all systems have a degree of autonomy. It ranges from a simple autonomous task (e.g., when it reacts to sensor reading) to the ability to be self-sufficient in a complex environment.",
            "hasSubAbilities": false,
            "abilityLevels": [
                {
                    "level": 0,
                    "levelName": "Basic action",
                    "levelDescription": "A system that executes a pre-defined sequence of actions that are unaffected by the environment and makes decisions based on its current state to proceed to the next action step."
                },
                {
                    "level": 1,
                    "levelName": "Basic decisional autonomy",
                    "levelDescription": "The system makes decisions based on basic perceptions and human or artificial agent  input and chooses its behavior from predefined alternatives."
                },
                {
                    "level": 2,
                    "levelName": "Continuous basic decisional autonomy",
                    "levelDescription": "The system alters the parameters of behavior in response to continuous input from perceptions or based on input control from a human or artificial agent  interacting continuously with the system. The system may be able to override or ignore the human or artificial agent  input when certain criteria are encountered."
                },
                {
                    "level": 3,
                    "levelName": "Simple autonomy without environment model",
                    "levelDescription": "The system uses perception to make moment-to-moment decisions about the environment and so controls interaction with the environment in order to achieve a predefined task."
                },
                {
                    "level": 4,
                    "levelName": "Simple autonomy with environment model",
                    "levelDescription": "The system uses perception to make moment-to-moment decisions about the environment and controls interaction with the environment to achieve a predefined task. The decisions made take into account an internal model of the environment."
                },
                {
                    "level": 5,
                    "levelName": "Task autonomy",
                    "levelDescription": "The system utilizes its perception of the environment to sequence different sub-tasks to achieve a higher-level task or mission. The events that cause behavioral changes are external and often unpredictable."
                },
                {
                    "level": 6,
                    "levelName": "Constrained task autonomy",
                    "levelDescription": "The system adapts its behavior to accommodate task constraints. These might be negative impacts in terms of failed sensors, or the need to optimize power utilization or other physical resources the process depends on, (water, chemical agents, etc). Alternatively, these might be constraints imposed by sensing ability, the environment, or the human agent."
                },
                {
                    "level": 7,
                    "levelName": "Multiple task autonomy",
                    "levelDescription": "The system chooses between multiple high-level tasks and can alter its strategy as it gathers new knowledge about the environment. The system will also take into account resource limitations and attempts to overcome them."
                },
                {
                    "level": 8,
                    "levelName": "Dynamic autonomy",
                    "levelDescription": "The system is able to alter its decisions about actions (sub-tasks) within the time frame of dynamic events that occur in the environment so that the execution of the task remains optimal to some degree."
                },
                {
                    "level": 9,
                    "levelName": "Mission oriented autonomy",
                    "levelDescription": "The system is able to dynamically alter its mission both within and between several high-level tasks in response to dynamic real-time events in the environment."
                },
                {
                    "level": 10,
                    "levelName": "Distributed autonomy",
                    "levelDescription": "The source for task and mission decisions can originate from outside of the system. The system is able to balance requests for action with its own tasking and mission priorities and can similarly communicate requests for action."
                }
            ]
        },
        {
            "abilityName": "Interaction",
            "abilityDescription": "The ability of a system to interact physically, cognitively either with human or artificial agents or other systems around it. The ability to interact may be simple as the use of a communication protocol. The ability to interact is critical to many areas of application. Interaction depends on both the medium of interaction and the context and flow of the interaction. The ability to interact takes place in two distinct ways: physical or  cognitive interaction.",
            "hasSubAbilities": true,
            "subAbilities": [
                {
                    "subAbilityName": "Human-system interaction",
                    "subAbilityDescription": "The following set of levels relate to the interaction between human agents and the system.",
                    "subAbilityLevels": [
                        {
                            "level": 0,
                            "levelName": "No interaction",
                            "levelDescription": "It is possible that the system will effectively have no operational interaction with a human agent."
                        },
                        {
                            "level": 1,
                            "levelName": "Direct control",
                            "levelDescription": "The human agent provides control of the system moment to moment. The system can translate, alter, or block these controls within parameters set by the human agent or system. The human agent controls are in the form of parameters that alter the control of the system. These parameters may be continuous quantities, or binary controls."
                        },
                        {
                            "level": 2,
                            "levelName": "Direct physical interaction",
                            "levelDescription": "The human agent controls the system by physically interacting with it. The system reacts to the human agent interaction by feeding back physical information to the human agent via the contact point."
                        },
                        {
                            "level": 3,
                            "levelName": "Task selection",
                            "levelDescription": "The system is able to execute pre-defined sequence of actions (tasks) autonomously. The human agent selects the subsequent action at the completion of the sequence of actions."
                        },
                        {
                            "level": 4,
                            "levelName": "Traded autonomy",
                            "levelDescription": "The system is able to operate autonomously during some parts of a task or in some tasks. Once this task or sub-task is complete the human agent will either select the subsequent task or intervene to control the system by direct interaction to carry out a task. This results in alternating sequences of autonomous and direct control of the system by the human agent."
                        },
                        {
                            "level": 5,
                            "levelName": "Task sequence control",
                            "levelDescription": "The system is able to execute sub-tasks autonomously, these sub-tasks will involve a higher level of decisional autonomy than a pre-defined sequence of actions. On completion of the sub-task human agent interaction is required to select the next sub-task resulting in a sequence of actions that make up a completed task."
                        },
                        {
                            "level": 6,
                            "levelName": "Supervised autonomy",
                            "levelDescription": "The system is able to execute a task autonomously in most operating conditions. The system is able to recognise when it is unable to proceed or when it requires human agent input to select alternative strategies or courses of action. These alternatives may involve periods of direct control."
                        },
                        {
                            "level": 7,
                            "levelName": "Task alternatives selection",
                            "levelDescription": "The system is able to autonomously execute tasks but requires the human agent to select between strategic task alternatives in order to execute a mission."
                        },
                        {
                            "level": 8,
                            "levelName": "Mission goal setting",
                            "levelDescription": "The system is able to execute tasks to achieve a mission. The human agent is able to interact with the system to direct the overall objectives of the mission."
                        }
                    ]
                }
            ]
        },
		{
            "abilityName": "Perception",
            "abilityDescription": "The ability of the system to perceive its environment. It includes the ability to interpret information and make informed and accurate deductions about the environment based on sensory data.",
            "hasSubAbilities": true,
            "subAbilities": [
				{
                    "subAbilityName": "General perception",
                    "subAbilityDescription": "The following levels refer to the generic ability of a system to perceive environmental state by sensor data.",
                    "subAbilityLevels": [
                        {
                            "level": 0,
                            "levelName": "Multi-parameter perception",
                            "levelDescription": "A system uses multiple single-parameter sensors to create a unified model of the environment. Sense data can be collected from multiple types of sensor as well as multiple sensors of the same type. Each sensor contributes information to the model. The model is used to alter the behaviour of the system."
                        },
                        {
                            "level": 1,
                            "levelName": "Feature-based perception",
                            "levelDescription": "Sense data is gathered from a region of the environment such that the sense data has a spatial mapping. The richness of the sense data information content is such that it is possible to apply feature extraction to the sense data and thereby interpret the content of the sense data as a set or sets of features. The system performs a data reduction with an assumption about the expected features. The presence of features is used to alter behaviour."
                        },
                        {
                            "level": 2,
                            "levelName": "Grouped feature detection",
                            "levelDescription": "The sense data gathered from the environment can be processed such that features can be aggregated to capture linkages between features. A group of features may relate to the same real element in the environment, but where the element has not been identified. The characteristics of the feature group can be used to alter the behaviour of the system. For example a set of features of the same colour that move in the same way may relate to a pink ball."
                        },
                        {
                            "level": 3,
                            "levelName": "Element identification",
                            "levelDescription": "The system can identify elements or coherent entities that it has detected in the environment through sets of grouped features and can use this identification to alter the system's behavior. The importance of this level is that a data source or a priori element model is required."
                        },
                        {
                            "level": 4,
                            "levelName": "Property identification",
                            "levelDescription": "The system is able to deduce the properties of elements in the environment or environment itself and utilise those properties within system behavior."
                        },
                        {
                            "level": 5,
                            "levelName": "Hidden state identification",
                            "levelDescription": "The system is able to infer properties of an element or person that are not directly observable. The elements are not fully available in data sources ahead of time and environment interpretation and classification are required."
                        }
                    ]
                } 
            ]
        },
        {
            "abilityName": "Cognitive",
            "abilityDescription": "The ability to interpret the task and environment such that tasks can be effectively and efficiently executed even where there exists environmental and/or task uncertainty. The ability to interpret human commands delivered in natural language or gestures. The ability to interpret the function and interrelationships between different elements in the environment and understand how to use or manipulate them. The ability to plan and execute tasks in response to high-level commands. The ability to work interactively with people as if like a person. Currently, different aspects and faculties of the Cognitive Ability as a whole have different degrees of maturity and pose different challenges.Attempting to combine these differences into a single rating or overarching target is likely to lead to invalid or misleading conclusions. The assessment of cognitive ability is therefore divided into several components or faculties. The assumption is that the cognitive ability of a system can be assembled and described more accurately by referring to a mixture of component abilities.",
            "hasSubAbilities": true,
            "subAbilities": [
                {
                    "subAbilityName": "Action",
                    "subAbilityDescription": "It concerns the ability of the system to act purposefully within its environment and the degree to which it is able to carry out actions and plan those actions. These abilities build on perception and decisional autonomy abilities. Action ability also co-depends on the other cognitive abilities.",
                    "subAbilityLevels": [
                        {
                            "level": 0,
                            "levelName": "Defined action",
                            "levelDescription": "The system executes fully pre-defined actions as a sequence of sub-actions. This sequence can repeat until stopped by an operator or other system event."
                        },
                        {
                            "level": 1,
                            "levelName": "Decision based action",
                            "levelDescription": "The system is able to alter its course of action based on perceptions or system events. It is able to select between a set of pre-defined actions based on its decisional autonomy ability."
                        },
                        {
                            "level": 2,
                            "levelName": "Sense driven action",
                            "levelDescription": "The system is able to modulate its action in proportion to parameters derived from its perceptions. The perceptions are used to drive the selection of pre-defined actions or the parameters of pre-defined actions."
                        },
                        {
                            "level": 3,
                            "levelName": "Optimized action",
                            "levelDescription": "The system is able to alter the sub-task sequence it applies to the execution of a task in response to perceptions or a need to optimize a defined task parameter."
                        },
                        {
                            "level": 4,
                            "levelName": "Knowledge driven action",
                            "levelDescription": "The system is able to utilize knowledge gained from perceptions of the environment including elements within it, to inform actions or sequences of action. Knowledge is gained either by accumulation over time or by embedding knowledge from external sources, including user inputs that associate properties with perceptions."
                        },
                        {
                            "level": 5,
                            "levelName": "Plan-driven action",
                            "levelDescription": "The system is able to use accumulated information about tasks to inform its plans for action."
                        },
                        {
                            "level": 6,
                            "levelName": "Dynamic planning",
                            "levelDescription": "The system is able to monitor its actions and alter its plans in response to its assessment of success."
                        },
                        {
                            "level": 7,
                            "levelName": "Task action suggestions",
                            "levelDescription": "The system is able to suggest tasks that contribute to the goals of a specific mission."
                        },
                        {
                            "level": 8,
                            "levelName": "Mission proposals",
                            "levelDescription": "The system is able to propose missions that align with high-level objectives."
                        }
                    ]
                },		
				{
                    "subAbilityName": "Acquired knowledge",
                    "subAbilityDescription": "Environments will always contain a number of unknowns. In many proposed application areas systems will encounter unknown situations as a normal part of task execution. The acquisition of knowledge about new situations is fundamental to the success of these new application areas.",
                    "subAbilityLevels": [
                        {
                            "level": 0,
                            "levelName": "No acquired knowledge",
                            "levelDescription": "The system does not acquire knowledge during its operation. Required knowledge is embedded in the system."
                        },
                        {
                            "level": 1,
                            "levelName": "Sense data and property knowledge",
                            "levelDescription": "The system is able to acquire knowledge about its environment and properties of elements in the environment based on sense data gathered from moment to moment."
                        },
                        {
                            "level": 2,
                            "levelName": "Persistent sense data knowledge",
                            "levelDescription": "The system is able to accumulate knowledge about its environment based on sense data that persists during the execution of the current task."
                        },
                        {
                            "level": 3,
                            "levelName": "Deliberate acquisition",
                            "levelDescription": "The system is able to acquire knowledge about the composition of its environment by executing actions that are deliberately designed to increase knowledge through exploration."
                        },		
						{
                            "level": 4,
                            "levelName": "Place knowledge",
                            "levelDescription": "The system is able to accumulate knowledge about the location and types of physical elements within physical environment in terms of matching elements to pre-defined and known types."
                        }, 
                        {
                            "level": 5,
                            "levelName": "Knowledge scaffolding",
                            "levelDescription": "The system has the ability to integrate embedded knowledge of elements and places with related knowledge gained from the environment."
                        },
                        {
                            "level": 6,
                            "levelName": "Requested knowledge",
                            "levelDescription": "The system is able to recognise that it has insufficient knowledge about an element or place relevant to the task and can formulate a question to gain that knowledge either from a person, or an external data source such as the internet or another system."
                        },
						{
                            "level": 7,
                            "levelName": "Distributed knowledge",
                            "levelDescription": "The system is able to communicate its gained knowledge to other systems, and can receive and integrate knowledge from other systems."
                        },
                        {
                            "level": 8,
                            "levelName": "Interaction acquisition",
                            "levelDescription": "The system is able to acquire knowledge about its environment and elements within it through planned interactions with the environment and elements."
                        },
						{
                            "level": 9,
                            "levelName": "Object function",
                            "levelDescription": "The system is able to acquire knowledge about the function of objects in the physical environment. This knowledge may be acquired directly or indirectly through observation."
                        }, 
                        {
                            "level": 10,
                            "levelName": "Human knowledge",
                            "levelDescription": "The system is able to acquire knowledge about the human by observation."
                        },
                        {
                            "level": 11,
                            "levelName": "Critical feedback",
                            "levelDescription": "The system is able to acquire knowledge about its actions by analysis of critical feedback that follows the completion of the action."
                        },
						{
                            "level": 12,
                            "levelName": "Long-term observation",
                            "levelDescription": "The system is able to distinguish between long-term and short-term changes in the environment and the entities within it."
                        },
						{
                            "level": 13,
                            "levelName": "Patterns of behaviour",
                            "levelDescription": "The system is able to acquire knowledge about the patterns of behaviour of the user that relate to the task."
                        },
                        {
                            "level": 14,
                            "levelName": "Observation learning",
                            "levelDescription": "The system is able to acquire knowledge indirectly from observing other systems or people carrying out tasks."
                        }
                    ]
                },
				{
                    "subAbilityName": "Reasoning",
                    "subAbilityDescription": "The reasoning ability is the glue that holds the cognitive structures together. Perception, and knowledge acquisition all rely to a certain extent on the ability to reason from uncertain data. As application tasks become more complex the need to provide task and mission-level reasoning increases.",
                    "subAbilityLevels": [
                        {
                            "level": 0,
                            "levelName": "Reasoning from sense data",
                            "levelDescription": "The system is able to make basic judgements of sense data sufficient to allow actions to be controlled."
                        },
                        {
                            "level": 1,
                            "levelName": "Pre-defined reasoning",
                            "levelDescription": "The system is able to use basic predefined knowledge about structures and elements in the environment to guide action and interaction."
                        },
                        {
                            "level": 2,
                            "levelName": "Basic environment reasoning",
                            "levelDescription": "The system is able to use knowledge of the environment gained from perception in conjunction with stored knowledge to reason about the environment."
                        },		
						{
                            "level": 3,
                            "levelName": "Reasoning under uncertainty",
                            "levelDescription": "The system is able to reason under uncertainty, e.g., about the environment and its elements, combining potentially conflicting or incomplete data from disparate sources."
                        },
                        {
                            "level": 4,
                            "levelName": "Dynamic reasoning",
                            "levelDescription": "The system is able to reason and operate under uncertainty in a dynamic environment. "
                        },
                        {
                            "level": 5,
                            "levelName": "Safety reasoning",
                            "levelDescription": "The system is able to reason about its safely operation in the environment."
                        },
                        {
                            "level": 6,
                            "levelName": "Task reasoning",
                            "levelDescription": "The system is able to reason about the appropriate courses of action to achieve a task where there are alternative actions that can be undertaken, exploiting information such as task objectives, time to completion, resource usage, or the desired performance level."
                        },
                        {
                            "level": 7,
                            "levelName": "Mission reasoning",
                            "levelDescription": "During the mission execution, the system is able to reason about the priorities of different tasks within the mission and propose priorities based on its knowledge of the mission, the tasks, and environment."
                        }
                    ]
                },
                {
                    "subAbilityName": "Cognitive human interaction",
                    "subAbilityDescription": "The following levels relate to different levels of human interaction with a system that has a cognitive element. They specifically relate to the interaction between a human and a single system. Where multiple systems are involved a corresponding set of levels applies.",
                    "subAbilityLevels": [
                        {        
			"level": 0,
                            "levelName": "No cognitive human interaction",
                            "levelDescription": "Many systems will be able to operate successfully without cognitive interaction with the human."
                        },
                        {
                            "level": 1,
                            "levelName": "Fixed interaction",
                            "levelDescription": "Interaction between the human and the system follows a fixed pattern. Typically, this takes place via a user interface with well-defined inputs and outputs. Fixed interaction also includes interaction via a computer-based user interface where interactions directly control the system according to pre-defined sets of commands with specific meaning. The connection between the human and the system may involve a wireless link. Any interpretation of commands is fixed and embedded."
                        },
                        {
                            "level": 2,
                            "levelName": "Task context interaction",
                            "levelDescription": "The system is able to interpret commands from the human that utilise task context semantics within a domain specific communication framework appropriate to the range of the task. The system is able to relay task status to the human using task context semantics suitable for the task."
                        },
                        {
                            "level": 3,
                            "levelName": "Element interaction",
                            "levelDescription": "The system is able to interpret user interactions that refer to elements as appropriate to the task. This includes the ability to interpret user interactions that identify elements as well as processing commands that reference elements relevant to the task. Dialogues are initiated by the human."
                        },
                        {
                            "level": 4,
                            "levelName": "System-triggered interaction",
                            "levelDescription": "The system is able to start a dialogue with the user in a socially appropriate manner relevant to its task or mission. The system has a basic understanding of the social interaction appropriate to the task/mission domain. The interaction may continue throughout the operating cycle for each task as is appropriate to the task/mission."
                        },
                        {
                            "level": 5,
                            "levelName": "Social interaction",
                            "levelDescription": "The system is able to maintain dialogues that cover more than one type of social interaction, or domain task. The system is able to manage the interaction provided it remains within the defined context of the task or mission."
                        },
                        {
                            "level": 6,
                            "levelName": "Complex social interaction",
                            "levelDescription": "Dialogues cover multiple social interactions and tasks, where the system is able to instruct the user to carry out tasks, or enter into a negotiation about how a task is specified. The interaction is typified by a bi-directional exchange of commands."
                        },
                        {
                            "level": 7,
                            "levelName": "Intuitive interaction",
                            "levelDescription": "The system is able to intuit the needs of a user with or without explicit command or dialogue. The user may communicate with the system without issuing explicit commands. The system will intuit from the current context and historical information the implied command."
                        }
                    ]
                }
            ]
        }
    ]
}
